###   Exercise

Hiring file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates,

2 yr experience, 9 test score, 6 interview score

12 yr experience, 10 test score, 10 interview score

In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
from sklearn.linear_model import LinearRegression 
import joblib 
%matplotlib notebook

#### read the data

In [2]:
df = pd.read_csv("hiring.csv") 
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

#### handling missing values

In [3]:
mean_of_test_score=round(df["test_score(out of 10)"].mean())
mean_of_test_score

8

In [4]:
df["test_score(out of 10)"].fillna(mean_of_test_score, inplace=True)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [5]:
df.experience.fillna(value=0,inplace=True)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

#### handling the string data

In [6]:
df.experience.replace(to_replace=["five","two","seven","three","ten","eleven"] ,value=[5,2,7,3,10,11],inplace=True)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

#### Assigning Features and target variables

In [7]:
x = df.drop('salary($)', axis=1)
y = df['salary($)']
x

   experience  test_score(out of 10)  interview_score(out of 10)
0           0                    8.0                           9
1           0                    8.0                           6
2           5                    6.0                           7
3           2                   10.0                          10
4           7                    9.0                           6
5           3                    7.0                          10
6          10                    8.0                           7
7          11                    7.0                           8

In [8]:
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

#### Bulding and training the Linear Regression model

In [9]:
model=LinearRegression()
model.fit(x,y)

LinearRegression()

#### testing score of our model on the training data

In [10]:
model.score(x,y)

0.9616780002577959

Using this predict salaries for following candidates,
- 2 yr experience, 9 test score, 6 interview score
- 12 yr experience, 10 test score, 10 interview score

In [11]:
model.predict([[2,9,6]])

array([53205.96797671])

In [12]:
model.predict([[12,10,10]])

array([92002.18340611])

#### Assign theta_0, theta_1, theta_2, theta_3 parameters

In [13]:
theta_0 = model.intercept_
theta_1 = model.coef_[0]
theta_2 = model.coef_[1]
theta_3 = model.coef_[2]
display(theta_0)
display(theta_1)
display(theta_2)
display(theta_3)

17737.26346433771

2812.954876273655

1845.7059679767092

2205.2401746724886

#### define our hypothesis function

In [14]:
def hypothesis(x1,x2,x3):
    return   theta_0 + theta_1*x1 + theta_2*x2 + theta_3*x3

#### testing the hypothesis function

In [15]:
hypothesis(2,9,6)

53205.96797671034

#### save the model

In [16]:
joblib.dump(model ,"predict salary")

['predict salary']

#### Load the model

In [17]:
joblib